Repository: yNEX/MHW_decoExportCompare
Catalog: locales/*/LC_MESSAGES/*.po
Languages: de

source: Usage: {0} [options] <old_export> <new_export>
de: Gebrauch: {0} [Optionen] <old_export> <new_export>

source: Compares two export files (JSON or TXT) used for tracking changes in decorations in Monster Hunter World.
de: Vergleicht zwei Exportdateien (JSON oder TXT), die zur Verfolgung von Änderungen in Dekorationen in Monster Hunter World verwendet werden.

source: This tool allows tracking changes in decorations and formats the output for Excel or as text.
de: Dieses Werkzeug ermöglicht es, Änderungen in Dekorationen nachzuverfolgen und das Ergebnis für Excel oder als Text zu formatieren.

source: For more information on 'Decorations Save Exporter', visit: https://www.nexusmods.com/monsterhunterworld/mods/3495
de: Für weitere Informationen über 'Decorations Save Exporter', besuchen Sie: https://www.nexusmods.com/monsterhunterworld/mods/3495

source: Options:
de: Optionen:

source: -e, --excel Path and filename for Excel output. Defaults to 'DecoChanges.xlsx' in the current directory.
de: -e, --excel Pfad und Dateiname für die Excel-Ausgabe. Standardmäßig 'DecoChanges.xlsx' im aktuellen Verzeichnis.

source: -t, --text Path and filename for Text output. Defaults to 'DecoChanges.txt' in the current directory.
de: -t, --text Pfad und Dateiname für die Text-Ausgabe. Standardmäßig 'DecoChanges.txt' im aktuellen Verzeichnis.

source: -b, --both Create both Excel and Text versions. Defaults to 'DecoChanges.xlsx' and 'DecoChanges.txt'.
de: -b, --both Erstelle sowohl Excel- als auch Textversionen. Standardmäßig 'DecoChanges.xlsx' und 'DecoChanges.txt'.

source: -h, --help Show this help message
de: -h, --help Zeigt diese Hilfenachricht an

source: By default, outputs are displayed in the terminal.
de: Standardmäßig werden die Ausgaben im Terminal angezeigt.

source: File extension not supported. Supported extensions:
de: Dateierweiterung nicht unterstützt. Unterstützte Erweiterungen:

source: The JSON files contain identical data. The files will not be compared.
de: Die JSON-Dateien enthalten identische Daten. Die Dateien werden nicht verglichen.

source: {}, amount: {}
de: {}, Anzahl: {}

source: {}, added: {} | {}
de: {}, hinzugefügt: {} | {}

source: Path to the first JSON file (old decorations)
de: Pfad zur ersten JSON-Datei (alte Dekorationen)

source: Path to the second JSON file (new decorations)
de: Pfad zur zweiten JSON-Datei (neue Dekorationen)

source: Path and filename for Excel output (default: DecoChanges.xlsx)
de: Pfad und Dateiname für Excel-Ausgabe (Standard: DecoChanges.xlsx)

source: Path and filename for Text output (default: DecoChanges.txt)
de: Pfad und Dateiname für Text-Ausgabe (Standard: DecoChanges.txt)

source: Create both Excel and Text versions
de: Erstelle sowohl Excel- als auch Textversionen

source: Decoration
de: Dekoration

source: Existing Decorations
de: Bestehende Dekorationen

source: Total added:
de: Insgesamt hinzugefügt:

source: No changes to existing decorations compared to previous data. The creation of the 'Existing Decorations' workbook has been skipped.
de: Keine Änderungen an bestehenden Dekorationen im Vergleich zu vorherigen Daten. Die Erstellung des Arbeitsbuchs 'Bestehende Dekorationen' wurde übersprungen.

source: New Decorations
de: Neue Dekorationen

source: No new decoration types identified compared to the previous export. The creation of the 'New Decorations' workbook has been skipped.
de: Keine neuen Dekorationstypen im Vergleich zum vorherigen Export identifiziert. Die Erstellung des Arbeitsbuchs 'Neue Dekorationen' wurde übersprungen.

source: Comparison data saved in the Excel file '{0}'.
de: Vergleichsdaten in der Excel-Datei '{0}' gespeichert.

source: No changes found between the two specified files. Therefore, no file was created.
de: Keine Änderungen zwischen den beiden angegebenen Dateien gefunden. Daher wurde keine Datei erstellt.

source: Error: Access to '{0}' denied. Ensure that the file is not open in another program and that you have the necessary permissions.
de: Fehler: Zugriff auf '{0}' verweigert. Stellen Sie sicher, dass die Datei nicht in einem anderen Programm geöffnet ist und dass Sie die notwendigen Berechtigungen haben.

source: -----Changes to Existing Decorations-----
de: -----Änderungen an bestehenden Dekorationen-----

source: -----No Changes to Existing Decorations-----
de: -----Keine Änderungen an bestehenden Dekorationen-----

source: -----Newly Added Decorations-----
de: -----Neu hinzugefügte Dekorationen-----

source: -----No Newly Added Decorations-----
de: -----Keine neu hinzugefügten Dekorationen-----

source: Total added (changed decorations): {0}
de: Insgesamt hinzugefügt (geänderte Dekorationen): {0}

source: Total added (new decorations): {0}
de: Insgesamt hinzugefügt (neue Dekorationen): {0}

source: Comparison data saved in the text file '{0}'.
de: Vergleichsdaten in der Textdatei '{0}' gespeichert.

source: Changes to Existing Decorations:
de: Änderungen an bestehenden Dekorationen:

source: Added
de: Hinzugefügt

source: Total
de: Gesamt

source: Newly Added Decorations:
de: Neu hinzugefügte Dekorationen:

source: Amount
de: Anzahl

source: Press Enter to open the created files, or choose one of the options:
de: Drücken Sie Enter, um die erstellten Dateien zu öffnen, oder wählen Sie eine der Optionen:

source: [e] Excel [t] Text [q] Exit
de: [e] Excel [t] Text [q] Beenden

source: [e] Excel [q] Exit
de: [e] Excel [q] Beenden

source: [t] Text [q] Exit
de: [t] Text [q] Beenden

source: Your choice:
de: Ihre Wahl:

source: Exiting script.
de: Skript wird beendet.

source: Invalid input or file not created.
de: Ungültige Eingabe oder Datei nicht erstellt.

source: An unexpected error occurred: {0}
de: Ein unerwarteter Fehler ist aufgetreten: {0}
